import { PostDetailsData, RelatedPost } from './post-details.types';

import { UserPreview } from '@/entities/user';

// ---------------------------------------------------------------------------
// Статичные данные из макета (В будущем заменить на данные из API)
// ---------------------------------------------------------------------------

const bonkeyMonkey: UserPreview = {
  id: 'bonkey-monkey',
  name: 'BonkeyMonkey',
  role: 'rude',
};

export const mockPost: PostDetailsData = {
  id: '1',
  title: 'Java или C# в 2026: Что выбрать новичку?',
  thread: {
    id: '1',
    title: 'Какой язык программирования учить в 2026?',
  },
  author: {
    id: 'code-master',
    name: 'CodeMaster',
    role: 'superAdmin',
    title: 'Волендеморт',
  },
  topic: 'Программирование',
  likesCount: 126,
  repliesCount: 133,
  viewsCount: 2331,
  createdAt: '2027-02-11T11:33:00',
  lastReplyAt: '2027-02-11T10:33:00',
  commentsCount: 7,
  content: `Всем привет! На дворе 2026 год, а я наконец-то решился кардинально изменить жизнь и войти в IT с полного нуля. Последний месяц я активно курю форумы, смотрю аналитику рынка, общаюсь со знакомыми разработчиками и, честно говоря, у меня уже голова идет кругом от обилия информации. В итоге я отбросил Python (потому что на джуниорские вакансии там сейчас дикий оверкволинг из-за нейросетей) и фронтенд (не лежит душа к верстке), и мой финальный выбор сузился до двух мощных тяжеловесов — Java и C#.

Мне очень нужен трезвый взгляд со стороны и совет бывалых, что из этого лучше выбрать новичку для старта прямо сейчас, в 2026-м.

С одной стороны, меня дико манит C#. Из того, что я успел прочитать, экосистема .NET сейчас переживает свой лучший период: Microsoft выкатила ультрасовременные версии, язык стал невероятно быстрым, кроссплатформенным и, как говорят, писать на нем — одно удовольствие из-за чистого и лаконичного синтаксиса. К тому же я с детства поглядываю в сторону геймдева, а C# — это главный пропуск в Unity. Но меня пугает один момент: когда я открываю локальные сайты с вакансиями (смотрю по СНГ и удаленке), предложений для джунов на «шарпе» как будто ощутимо меньше, да и старый стереотип, что C# жестко привязан к Windows, кажется, всё еще сидит в головах у многих консервативных работодателей.

С другой стороны, есть монументальная Java. Это, как я понимаю, абсолютная стабильность и вечный спрос. На ней написана вся банковская сфера, огромный Enterprise, финтех и куча госорганов. Да, язык ругают за некоторую громоздкость и консерватизм (хотя в последних версиях вроде Java 25 это активно исправляют), но объем legacy-кода в мире настолько огромен, что без работы Java-разработчик не останется в ближайшие лет двадцать точно. Плюс, если я перегорю к бэкенду, со знанием Java можно будет относительно легко мигрировать в мобильную разработку под Android на Kotlin. Однако тут свои подводные камни: огромная конкуренция среди таких же новичков, как я, и достаточно высокий, душный порог входа из-за фреймворка Spring, который требуют буквально на каждом собеседовании.

Ребята, помогите расставить приоритеты и сделать правильную ставку, чтобы не прогадать на старте. Что сейчас перспективнее для быстрого трудоустройства? Где экосистема дружелюбнее к новичку, который учится самостоятельно? Стоит ли гнаться за красотой C# и .NET или лучше пойти по консервативному, но надежному пути Java? Заранее всем спасибо за конструктивные ответы и личный опыт!`,
  comments: [
    {
      id: '1',
      author: bonkeyMonkey,
      text: 'Ну , я думаю лучше джава, джава скрипт сосёт 😝',
      replies: [
        {
          id: '2',
          author: {
            id: 'anti-monkey',
            name: 'AntiMonkey',
            role: 'moderator',
          },
          text: 'Перечитай правила сайта! Выдаю предупреждение!!!',
          hiddenRepliesCount: 5,
          replies: [
            {
              id: '3',
              author: { ...bonkeyMonkey, role: 'member' },
              text: 'Обизьяна голой жопой не пугай расист ',
            },
          ],
        },
        {
          id: '4',
          author: {
            id: 'momoboy',
            name: 'Momoboy',
            role: 'member',
          },
          text: 'Твой банан у меня',
          replies: [
            {
              id: '5',
              author: bonkeyMonkey,
              text: 'А чапалахов тебе не завернуть?',
            },
          ],
        },
      ],
    },
    {
      id: '6',
      author: {
        id: 'ponkey-donkey',
        name: 'PonkeyDonkey',
        role: 'member',
      },
      text: 'ИнтересТный вАпрос на самам деле , наверное C# лучше джавы, поддерживается Windows и там ещё есть .NET который в себя включает кучу всего, начиная от мобильной разработки заканчивая веб разработкой и бэком, + игры можно делать на юнити, в общем швейцарский нож получается',
      hiddenRepliesCount: 5,
    },
    {
      id: '7',
      author: {
        id: 'soso-vorontsov',
        name: 'сосо Воронцов',
        role: 'member',
      },
      text: `Сие прилюдное противостояние, развернувшееся на бескрайних просторах ИТ-вселенной года 2026-го, можно расценивать по-разному. Кто-то увидит здесь руку мудрого наставника, а кто-то — очередную попытку задушить неокрепший разум святыми догматами. Можно бесконечно разводить демагогию на форумах, до хрипоты спорить о сборщиках мусора и замерять наносекунды скорости, но истинность бытия это не решит — ведь в конце концов оба пути ведут к поиску пропущенной точки с запятой в три часа ночи.
Посему, юный падаван, не трать свой ментальный ресурс на священные войны. Обходись любым синтаксисом, который больше импонирует твоему сердцу и обещает более сытное будущее. Выбирай то, к чему лежит душа: будь то древняя, как мир, многословная Java с её бесконечными фабриками фабрик, или элегантный, обласканный Microsoft си-шарп, на котором так приятно писать код, пока не закончатся бесплатные лицензии. К счастью, в этом дивном новом мире выбрать между двумя близнецами-братьями юному мужу стало гораздо легче — ведь оба они одинаково далеки от идеала, но одинаково хорошо кормят.`,
      hiddenRepliesCount: 5,
    },
  ],
};

export const mockRelatedPosts: RelatedPost[] = [
  {
    id: '6',
    title: 'Стоит ли учить Vue в 2026?',
    position: 6,
    commentsCount: 24,
    views: '1.1k',
  },
  {
    id: '22',
    title: 'Достоевский или Булгаков? Кто вам сильнее симпатизирует?',
    position: 22,
    commentsCount: 11,
    views: '531',
  },
  {
    id: '2',
    title: 'Пепе шнейне ватафа?',
    position: 2,
    commentsCount: 111,
    views: '2.1k',
  },
];

export const mockPostIds = [
  mockPost.id,
  mockPost.thread.id,
  ...mockRelatedPosts.map(({ id }) => id),
];
