export const communityRules = [
  'Будьте вежливы и уважительны',
  'Запрещён спам, флуд и любая несанкционированная реклама',
  'Не публикуйте личные данные (как свои так и чужие)',
  'Офтоп. Запрещено уводить обсуждение в сторону от темы, заданной автором топика. Для отвлеченных разговоров есть соответствующий раздел',
  'Строго запрещено обсуждение политики, религии и межнациональных розней',
  'Запрещена намеренная дезинформация, клевета, фейки и провокации (троллинг)',
  'Используйте поиск перед публикацией, чтобы избежать повтора тем',
  'Оформляйте код, логи и большие изображения в специальные теги/спойлеры',
] as const;
